feat: Add skills and fix sequence diagram
